"use client";
import React from "react";
import { Col, Collapse, Row } from "antd";
import Title from "antd/es/typography/Title";
import Text from "antd/es/typography/Text";
import { CaretRightOutlined } from "@ant-design/icons";

const FAQ = () => {
  const items = [
    {
      key: "1",
      label: "ALLOT কি? এটা কিভাবে কাজ করে?",
      children: (
        <Text>
          ALLOT একটি বিজনেস সল্যুশন ও অটোমেশন সফ্‌টওয়্যার। যার মাধ্যমে কোন
          প্রতিষ্ঠান তার সামগ্রিক সাপ্লাই চেইন প্রক্রিয়া সম্পাদন করতে পারবে। এবং
          এটা কর্ম ক্ষেত্রে কর্মী দক্ষতা ও নির্ভুল ওয়্যারহাউজ পরিচালনায় সহায়তা
          করে। এই সফ্‌টওয়্যার এর মাধ্যমে প্রতিষ্ঠান পেপার ওয়ার্ক ছাড়ায় তার
          পার্চেজ ও ওয়্যারহাউজ ম্যানেজমেন্ট করতে পারবে।
        </Text>
      ),
    },
    {
      key: "2",
      label: "কোন ধরনের প্রতিষ্ঠান ALLOT ব্যবহারের উপযোগী?",
      children: (
        <Text>
          ALLOT কে এমনভাবে ডিজাইন ও ডেভেলপ করা হয়েছে যে, এটা যে কোনো ধরনের
          প্রতিষ্ঠানে ব্যবহার উপযোগী। একটি স্টার্টাপ প্রতিষ্ঠান যেমন ভাবে এর
          মাধ্যমে ম্যানেজমেন্ট করা যাবে, তেমন ভাবে একটি প্রতিষ্ঠিত প্রতিষ্ঠানেও
          সহজেই ম্যানেজ করা যাবে। এবং এখানে করপোরেট কালচার এর সব ধরনের বিষয়
          বিবেচনা করে তৈরি করা হয়েছে।
        </Text>
      ),
    },
    {
      key: "3",
      label: "ALLOT কী পেপারলেস সফ্‌টওয়্যার?",
      children: (
        <Text>
          ALLOT এর মডিউল গুলো এমনভাবে ডিজাইন করা হয়েছে, যেন প্রতিষ্ঠান কোনো রকম
          পেপার ওয়ার্ক ছাড়ায় পার্চেজ চাহিদা থেকে শুরু করে ওয়্যারহাউজ ডিমান্ড ও
          স্টক ম্যানেজমেন্ট করতে পারে। আপনার প্রতিষ্ঠান রিভিউ করে ALLOT এর সাথে
          সমন্বয় কীভাবে করবেন সেটার দিকনির্দেশনা দেওয়া হবে।
        </Text>
      ),
    },
    {
      key: "4",
      label: "প্যাকেজ কাস্টমাইজড করে নেওয়া যাবে?",
      children: (
        <Text>
          ALLOT এর মডিউল গুলো স্বতন্ত্র ভাবে ডেভেলপ করা, ফলে চাইলে প্যাকেজ
          প্রয়োজন অনুযায়ী কাস্টমাইজড করে নেওয়া যাবে।
        </Text>
      ),
    },
    {
      key: "5",
      label: "ডাটা সিকিউরিটি কেমন?",
      children: (
        <Text>
          ALLOT এ মাল্টি লেয়ারে ডাটা ফেসিং হয়ে থাকে। ফলে একজন ভ্যালিড ইউজার ছাড়া
          অন্যকেউ ডাটা এক্সেস করতে পারে না। এছাড়াও নির্দিষ্ট অথিন্টিকেশন
          প্রক্রিয়ায় ইউজারে অ্যাক্টিভিটি অব্জার্ভ করে, ফলে আন-অথরাইজ ইউজার
          কোনোভাবেই ডাটা সিকিউরিটি ব্রেক করে পারে না।
        </Text>
      ),
    },
    {
      key: "6",
      label: "ডাটা ব্যাকআপ কিভাবে পাবেন?",
      children: (
        <Text>
          ALLOT এ মডিউল অনুযায়ী রিপোর্ট প্যানেল তৈরি করা আছে। ফলে প্রতিষ্ঠান
          চাইলেই যে কোন সময়ে তার প্রয়োজনীয় ডাটা এক্সেল এক্সপোর্টের মাধ্যমে নিজে
          সংরক্ষন করতে পারবেন। যদি কোন প্রতিষ্ঠান চুক্তি থেকে অবহতি নেয় তাহলে
          প্রয়োজনীয় ডাটা গুলোর CSV ফাইল প্রদান করা যাবে।
        </Text>
      ),
    },
  ];
  return (
    <>
      <section>
        <Row justify="center">
          <Col span={6}>
            <Title
              level={2}
              style={{
                fontWeight: "500",
                display: "block",
                textAlign: "center",
              }}
            >
              কিছু জিজ্ঞাসা
            </Title>
            <div
              style={{
                height: "1px",
                width: "80%",
                backgroundColor: "#247f93",
                margin: "0 auto",
              }}
            />
          </Col>
        </Row>
        <Row justify="center" style={{ paddingTop: "50px" }}>
          <Col span={12}>
            <Collapse
              expandIcon={({ isActive }) => (
                <CaretRightOutlined rotate={isActive ? 90 : 0} />
              )}
              items={items}
            />
          </Col>
        </Row>
      </section>
    </>
  );
};

export default FAQ;
